In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import csv
from scipy import stats
import seaborn as sns
%matplotlib inline
sns.set_style("darkgrid")
# https://stackoverflow.com/a/37347783/7060068
pd.set_option('display.max_columns', None)  # or 1000
pd.set_option('display.max_rows', None)  # or 1000

In [10]:
mat = np.zeros([2, 2])
mat

array([[0., 0.],
       [0., 0.]])

In [11]:
a = np.where(mat[0] == 0)
a

(array([0, 1]),)

In [25]:
b = np.random.choice(a[0])
b

0

In [2]:
num_rows = 20
years = list(range(1990, 1990 + num_rows))
data_preproc = pd.DataFrame({
    'Year': years, 
    'A': np.random.randn(num_rows).cumsum(),
    'B': np.random.randn(num_rows).cumsum(),
    'C': np.random.randn(num_rows).cumsum(),
    'D': np.random.randn(num_rows).cumsum()})

In [6]:
data_preproc.head()

   Year         A         B         C         D
0  1990  1.103739  1.513563  0.795985  0.152437
1  1991  1.008187  0.653633  1.212973 -0.371794
2  1992  1.521042  1.696600  2.583366 -0.820683
3  1993  3.994997  1.387663  2.231218 -2.255844
4  1994  4.123583  0.046389  3.913863 -2.947343

In [7]:
data=pd.melt(data_preproc, ['Year'], var_name='variables', value_name='')
data.head()

   Year variables     value
0  1990         A  1.103739
1  1991         A  1.008187
2  1992         A  1.521042
3  1993         A  3.994997
4  1994         A  4.123583

In [11]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})

In [15]:
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [16]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [17]:
df.rename(columns={"A": "C"})

   C  B
0  1  4
1  2  5
2  3  6